problem_screen = [
    {
        "prompt":"화면이 깜빡거리는데 어떻게 해?",
        "completion":"1. 제품의 화면이 간헐적으로 깜박거리고 밝지 않다면 전력 소모를 줄일 수 있는 \
            삼성전자의 효율적인 기능 중 일부를 해제해야 할 수도 있습니다. \n\
            아래의 네 가지 경로로 밝기 최적화 또는 밝기 낮추기, 모션 밝기 조정, 자동 명암 조정 기능을 해제한 뒤 다시 확인하세요.\n\
            1) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'전원 및 절전'>'밝기 최적화'\n\
            2) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'전원 및 절전'>'밝기 낮추기'\n\
            3) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'전원 및 절전'>'모션 밝기 조정'\n\
            4) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'화면'>'전문가 설정'>'자동 명암 조정'\n\
            2. 리모컨에서 '홈'버튼을 누르고 '메뉴'>'설정'>'고객지원'>'디바이스 케어'>'자가진단'>'화질 테스트'를 선택하여 화질 테스트를 진행하세요.\n\
            화질테스트가 정상이면 연결된 기기의 신호문제인지 점검하세요.\n"
    },
    {
        "prompt":"화면이 어두운데 어떻게 해?",
        "completion":"1. 제품의 화면이 간헐적으로 깜박거리고 밝지 않다면 전력 소모를 줄일 수 있는 \
            삼성전자의 효율적인 기능 중 일부를 해제해야 할 수도 있습니다. \n\
            아래의 네 가지 경로로 밝기 최적화 또는 밝기 낮추기, 모션 밝기 조정, 자동 명암 조정 기능을 해제한 뒤 다시 확인하세요.\n\
            1) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'전원 및 절전'>'밝기 최적화'\n\
            2) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'전원 및 절전'>'밝기 낮추기'\n\
            3) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'전원 및 절전'>'모션 밝기 조정'\n\
            4) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'화면'>'전문가 설정'>'자동 명암 조정'\n\
            2. 리모컨에서 '홈'버튼을 누르고 '메뉴'>'설정'>'고객지원'>'디바이스 케어'>'자가진단'>'화질 테스트'를 선택하여 화질 테스트를 진행하세요.\n\
            화질테스트가 정상이면 연결된 기기의 신호문제인지 점검하세요.\n"
    },
    {
        "prompt":"화면이 밝지 않은데 어떻게 해?",
        "completion":"화면 밝기가 너무 어둡다면 아래의 경로를 통해 먼저 화면 초기화 진행 후 설정값을 변경하거나 밝기 최적화, 밝기 낮추기 기능을 해제해 보세요.\n\
            1) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'화면'>'전문가 설정'>'화면 초기화'\n\
            2) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'전원 및 절전'>'밝기 최적화'\n\
            3) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'전원 및 절전'>'밝기 낮추기'\n"
    },
    {
        "prompt":"화면의 색감이 풍부하지 않은데 어떻게 해?",
        "completion":"아래의 경로를 통해 화면 모드나 명암, 밝기, 선명도 등 화질 세부 항목의 설정값을 조정하세요.\n\
            1) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'화면'>'화면 모드'\n\
            2) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'화면'>'전문가 설정'>'명암'\n\
            3) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'화면'>'전문가 설정'>'밝기'\n\
            4) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'화면'>'전문가 설정'>'선명도'\n\
            5) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'화면'>'전문가 설정'>'채도'\n\
            6) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'화면'>'전문가 설정'>'색조(녹/적)\n\"
    },
    {
        "prompt":"화면 색상이 제대로 보이지 않는데 어떻게 해?",
        "completion":"1. 제품 화면 색상이 이상하다면 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'고객지원'>'디바이스 케어'>'자가 진단'>'화질 테스트'를 선택하여 화질테스트를 진행하세요.\n\
            2. 테스트 결과 이상이 없다면 다음의 사항을 확인하세요. 잘못된 연결은 색상 및 화면이 나오지 않는 문제의 원인이 될 수 있습니다.\n\
            1) One Conect 박스를 사용할 경우 영상 입력 단자와 외부 기기의 영상 출력 단자가 제대로 연결돼 있는지 확인하세요.\n\
            2) 컴포넌트 케이블을 사용할 경우 초록색(Y), 파란색(Pb), 빨간색(Pr)이 각각 제대로 연결돼 있는지 확인하세요. 컴포넌트 입력 단자는 모델에 따라 지원되지 않을 수 있습니다.\n"
    },
    {
        "prompt":"화면이 흑백으로 보이는데 어떻게 해?",
        "completion":"1. 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'고객지원'>'디바이스 케어'>'자가 진단'>'화질 테스트'를 선택하여 화질테스트를 진행하세요.\n\
            2. 테스트 결과 이상이 없다면 다음의 사항을 확인하세요. 잘못된 연결은 색상 및 화면이 나오지 않는 문제의 원인이 될 수 있습니다.\n\
            1) One Conect 박스를 사용할 경우 영상 입력 단자와 외부 기기의 영상 출력 단자가 제대로 연결돼 있는지 확인하세요.\n\
            2) 컴포넌트 케이블을 사용할 경우 초록색(Y), 파란색(Pb), 빨간색(Pr)이 각각 제대로 연결돼 있는지 확인하세요. 컴포넌트 입력 단자는 모델에 따라 지원되지 않을 수 있습니다.\n\
            3. AV 기기를 TV에 연결할 경우 컴포짓(Composite) 케이블을 연결하세요.\n\
            4. 컴포짓(Composite) 케이블을 사용할 경우 영상 케이블(노란색/녹색)을 컴포넌트 노란색/녹색 단자에 연결하세요.\n\
            5. 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'접근성'>'흑백'을 선택하여 흑백 설정이 켜져 있는지 확인하세요.\n"
    },
    {
        "prompt":"TV 전원이 저절로 꺼지는데 어떻게 해?",
        "completion":"1. TV의 전원이 갑자기 꺼진다면 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'시스템 관리'>'시간 설정'>'취침 예약'을 선택하여 취침 예약이 설정돼 있는지 확인하세요.\n\
            2. 취침 예약이 설정돼 있지 않으면 아래의 경로를 통해 자동 전원 끄기 또는 꺼짐 시간 예약이 설정돼 있는지 확인하세요.\n\
            1) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'전원 및 절전'>'자동 전원 끄기'\n\
            2) 리모컨 '홈'버튼>'메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'시스템 관리'>'시간 설정'>'꺼짐 시간 예약'\n"
    },
    {
        "prompt":"TV 전원이 안꺼지는데 어떻게 해?",
        "completion":"The Frame 모델의 경우 TV 시청 중 전원 버튼을 짧게 누르면 아트 모드로 전환되고, 아트 모드에서 전원 버튼을 짧게 누르면 TV를 시청할 수 있습니다. 전원 버튼을 길게 누르면 TV를 완전히 끌 수 있습니다.\n"
    },
    {
        "prompt":"TV 전원이 안켜지는데 어떻게 해?",
        "completion":"1. 전원 코드를 분리한 후 다시 연결하고, 리모컨의 배터리를 확인하세요.\n\
            2. 안테나 케이블 연결이 제대로 되어있는지 확인하세요.\n\
            3. 외부기기가 켜져 있는지 확인하세요. 꺼져있다면 외부 기기의 전원을 켜세요.\n\
            4. One Connect 박스 지원 모델의 경우 TV와 One Conect 박스를 연결한 매직 케이블 혹은 One Connect 케이블의 연결 상태를 확인하세요.\n"
    },
    {
        "prompt":"TV가 계속 켜져 있는데 어떻게 해?",
        "completion":"주변이 너무 어둡거나 밝으면 모션 센서가 정상적으로 동작하지 않을 수 있습니다.\
            설치 환경(높이, 기울기, 장애물)에 따라 모션 센서의 성능이 영향을 받을 수 있습니다.\
            입고 있는 옷이나 피부 색이 주변의 명압과 유사하면 모션 센서가 정상적으로 동작하지 않을 수 있습니다.\n\
            모션 센서는 모델이나 지역에 따라 지원되지 않을 수 있습니다.\n"
    },
    {
        "prompt": "TV가 자동으로 켜지지 않는데 어떻게 해?",
        "completion": "TV는 주변의 모든 시각적 변화(조명, 디스플레이, 애완견, 창밖 변화 등)에 반응해 동작합니다.\
            리모컨의 '홈'버튼과 왼쪽 방향 버튼을 순서대로 누른 후 '아트', '아트 모드 옵션', '모션센서 감도'를 선택하여 모션센서 민감도 조절을 통해 반응 수준을 조절할 수 있습니다.\n\
            아트 모드 옵션은 아트 홈의 가장 아래에 있습니다. 옵션을 설정하려면 스크롤을 맨 아래로 내리세요.\n\
            모션센서 감도는 모델에 따라 지원되지 않을 수 있습니다.\n"
    },
    {
        "prompt":"채널이 나오지 않는데 어떻게 해?",
        "completion":"1. 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'채널/방송'>'자동 채널 설정'을 선택하여 자동 채널 설정을 실행하세요.\n\
            2. 셋톱 박스, IP TV 등 방송 수신기를 사용하는 경우 리모컨의 '홈'버튼을 누른 후 '메뉴'>'연결된 기기'>'연결 가이드'를 선택하여 TV와의 연결 상태를 확인하세요.\n\
            3. 지속적인 증상이 발생할 경우 방송 서비스 업체에 문의하세요.\n"
    },
    {
        "prompt":"TV 화질이 안좋은데 어떻게 해?",
        "completion":"1. 디지털 방송 수신기, IPTV, 셋톱박스 등 기기의 출력 해상도를 UHD 또는 HD로 조정하세요.\n\
            셋톱박스, 케이블박스가 UHD 콘텐츠 또는 방송을 지원하는지 확인하고 해상도를 설정하세요. 자세한 내용은 방송 서비스 업체에 문의하세요.\n\
            2. 고화질의 영상을 이용하기 위해서는 HDMI 케이블을 사용해야 합니다.\n\
            3. PC의 경우 UHD 해상도 지원이 가능한 그래픽 카드를 사용해야 합니다.\n\
            4. 삼성 TV Plus 채널을 이용하면 네트워크 연결 상태를 확인하세요. 네트워크 속도가 느리면 앱이 동작하지 않거나 화면이 저화질로 나올 수 있습니다.\n"
    },
    {
        "prompt":"화면의 영상이 흐리면 어떻게 해?",
        "completion":"TV 화면에서 흐릿한 형체가 나타난다면 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'화면'>'전문가 설정'>'동영상 최적화 설정'을 선택하여 동영상 최적화 설정 기능을 사용하세요.\n\
            움직임이 많은 영상을 최적화하여 화면의 흐림 및 떨림을 제거할 수 있습니다.\n"
    },
    {
        "prompt": "화면이 왜곡되어 보이면 어떻게 해?"
        "completion": "스포츠나 액션 영화 같은 빠르게 움직이는 화면에서 동영상 콘텐츠의 압축 때문에 화면 왜곡 현상이 나타날 수 있습니다.\n\
            신호가 약하거나 수신 상태가 좋지 않은 경우 화면 왜곡을 유발할 수 있는데 이것은 이상 증상이 아닙니다.\n\
            TV 근처(1m 이내)에 휴대폰이 있다면 아날로그와 디지털 채널의 화면에 노이즈가 발생할 수 있습니다.\n"
    },
    {
        "prompt": "화면 가장자리에 점선이 보이면 어떻게 해?"
        "completion": "1. 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'화면'>'화면 크기 설정'>'화면 크기'를 선택하여 화면 크기를 16:9 표준으로 변경하세요.\n\
            2. 외부 기기의 해상도를 변경하세요.\n"
    },
    {
        "prompt": "전체 화면으로 조정하고 싶으면 어떻게 해?"
        "completion": "HD 채널에서 일반 화질(4:3)의 콘텐츠가 재생되면 화면 양쪽에 검은색 여백이 나타납니다.\n\
            화면 비율이 TV와 다른 영화를 감상할 때, 화면 위/아래에 검은색 여백이 나타납니다.\n\
            외부 기기의 화면 크기를 조정하거나, 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'화면'>'화면 크기 설정'>'화면 크기'를 선택하여 TV의 화면 크기를 전체 화면으로 조정해 보세요.\n"
    },
    {
        "prompt": "TV 메뉴에서 자막 기능이 동작하지 않는데 어떻게 해?"
        "completion": "외부 기기가 HDMI 케이블이나 컴포넌트 케이블로 연결된 경우 자막을 사용할 수 없습니다. 외부기기에서 자막을 조정하세요.\n"
    },
        {
        "prompt": "자막을 끄고 싶은데 어떻게 해?"
        "completion": "리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'접근성'>'자막 설정'>'자막'을 선택하여 자막 기능을 끌 수 있습니다.\n"
    },
    {
        "prompt": "연결된 외부기기의 HDR 기능이 꺼지는데 어떻게 해?"
        "completion": "리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'연결'>'외부기기 관리'>'입력 신호 확장'을 선택하여 입력 신호 확장 기능을 켜면, 해당 HDMI 입력 신호의 수신 범위가 활장되어 외부 기기로부터 송출된 HDR 콘텐츠를 시청할 수 있습니다.\n"
    }
]

problem_channel = [
    {
        "prompt":"'입력 신호가 없습니다'라는 메시지가 뜨면 어떻게 해?",
        "completion" :"1. 케이블 연결 상태나 외부 기기의 전원 상태를 확인하세요.\n\
            2. 리모컨의 '홈'버튼을 누른 후 '메뉴'>'연결된 기기'>'TV/외부입력'을 선택해 다른 외부 입력으로 전환하세요.\n\
            3. 셋톱박스, 케이블 박스를 사용하는 경우 외부 기기에 연결된 네트워크나 방송 신호 연결 상태를 확인하세요.\n"
    },
    {
        "prompt":"모든 채널이 수신되지 않으면 어떻게 해?",
        "completion" :"1. 안테나 케이블이 제대로 연결됐는지 확인하세요.\n\
            2. 아래의 경로를 통해 초기화 또는 자동 채널 설정을 실행해 수신 가능한 채널을 모두 추가하세요.\n\
            1) 리모컨 '홈'버튼>'설정'>'전체 설정'>'일반 및 개인정보'>'초기화'\n\
            2) 리모컨 '홈'버튼>'설정'>'전체 설정'>'채널/방송'>'자동 채널 설정'\n"
    },
    {
        "prompt":"자막이 안나오면 어떻게 해?",
        "completion" :"1. TV에 안테나 케이블을 연결하고 채널을 시청하는 경우, 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'접근성'>'자막 설정'을 선택해 자막 설정 기능을 실행해보세요.\
            일부 채널은 자막을 지원하지 않을 수 있습니다.\n\
            2. 셋톱박스, 케이블 박스 등 외부 기기로 채널을 시청하는 경우 해당 기기에서 자막 기능을 설정하세요. 자세한 설정 방법은 해당 서비스 제공 업체에 문의하세요.\n"
    },
    {
        "prompt":"채널/방송이 비활성화되었으면 어떻게 해?",
        "completion" :"채널/방송은 TV/외부입력을 TV로 선택한 경우에만 사용 가능합니다. 외부 기기를 통해 TV를 시청할 경우 채널/방송은 사용할 수 없습니다. 녹화 중 또는 타임시프트가 동작 중일 때에는 일부 채널/방송을 사용할 수 없습니다.\n"
    }
]

problem_external_device = [
    {
        "prompt":"",
        "completion":""
    },
    {
        "prompt":"",
        "completion":""
    },
    {
        "prompt":"",
        "completion":""
    },
    {
        "prompt":"",
        "completion":""
    },
    {
        "prompt":"",
        "completion":""
    },
    {
        "prompt":"",
        "completion":""
    }
]

problem_network = [
    {
        "prompt" : "무선 네트워크 연결이 안되면 어떻게 해?",
        "completion" : "1. 리모컨의 '홈'버튼을 누른 후 '설정'>'고객지원'>'디바이스 케어'>'자가 진단'>'스마트 허브 연결 테스트'를 선택해 자가 테스트를 실행하세요.\n\
            2. 네트워크 케이블이 연결돼 있는지, 공유기의 전원이 켜져 있는지 확인하세요.\n\
            3. 공유기에 모바일 기기를 WIFI로 연결해 보세요.\n\
            4. 공유기의 전원을 껐다가 켜보세요.\n\
            5. 보안키가 설정된 경우, 보안키를 정확히 입력했는지 확인하세요.\n\
            6. TV의 전원 케이블을 뽑은 다음 다시 연결하거나 전원 버튼을 3초 동안 길게 누르세요.\n\
            7. TV와 공유기 사이에 전자파를 발생할 수 있는 제품을 치워주세요.\n\
            8. 무선이 안될 경우 유무선 공유기와 TV를 유선으로 연결해주세요.\
            유선으로 연결해 정상적으로 작동이 될 경우 유무선 공유기가 고장일 수 있으니 유무선 공유기를 바꿔주세요.\
            유선 네트워크는 일부 모델에서 지원되지 않을 수 있습니다.\n"
    },
    {
        "prompt" : "유선 네트워크 연결이 안되면 어떻게 해?",
        "completion":"1. LAN 케이블 연결을 확인하세요. \n\
            2. LAN 케이블이 이미 연결된 경우에는 공유기의 전원이 켜져 있는지 확인하고 전원을 껐다 켜세요.\n\
            3. 유선 네트워크는 일부 모델에서 지원되지 않을 수 있습니다.\n"
    },
    {
        "prompt": "IP를 자동으로 설정하지 못하면 어떻게 해?",
        "completion":"1. 공유기 외부망 LAN 단자에 네트워크 LAN 케이블이 연결돼 있는지 확인하세요.\n\
            2. 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'네트워크'>'네트워크 상태'>'IP 설정'을 선택해 DNS 설정값을 확인하세요.\n\
            3. IP 및 DNS 설정이 자동 설정인지 확인하고, 수동 사용이면 네트워크 제공 업체에 IP 및 DNS Server 값을 확인하세요.\n\
            4. 유선 네트워크는 일부 모델에서 지원되지 않을 수 있습니다.\n"
    },
    {
        "prompt": "공유기에는 연결되었는데 인터넷이 안되면 어떻게 해?",
        "completion":"1. 공유기 외부망 LAN 단자에 네트워크 LAN 케이블이 연결돼 있는지 확인하세요.\n\
            2. 리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'네트워크'>'네트워크 상태'>'IP 설정'을 선택해 DNS 설정값을 확인하세요.\n\
            3. IP 및 DNS 설정이 자동 설정인지 확인하고, 수동 사용이면 네트워크 제공 업체에 IP 및 DNS Server 값을 확인하세요.\n\
            4. 유선 네트워크는 일부 모델에서 지원되지 않을 수 있습니다.\n"
    }
]

problem_anynet = [
    {
        "prompt":"Anynet+ 기능이 뭐야?",
        "completion":"TV와 연결된 외부 기기 중 HDMI-CEC를 지원하는 외부 기기를 TV 리모컨 하나로 제어함으로써 외부 기기를 쉽고 간편하게 사용할 수 있도록 하는 기능입니다. \
            대표적으로 TV및 외부 기기의 전원을 동시에 켰다가 끌 수 있습니다.\n"
    },
    {
        "prompt":"Anynet+에서 연결된 기기가 표시되지 않으면 어떻게 해?",
        "completion":"1. 기기가 Anynet+(HDMI-CEC) 기기인지 확인하세요. 기기의 설정 메뉴에서 HDMI-CEC 항목이 켜져 있는지 확인하세요.\n\
            2. 리모컨의 '홈'버튼을 누른 후 '설정'>'일반'>'외부기기 관리'>'Anynet+(HDMI-CEC)'를 선택해 Anynet+(HDMI-CEC) 기능이 켜져있는지 확인하세요.\n\
            3. 기기의 전원 코드가 제대로 연결되어 있는지 확인하세요. 기기의 HDMI 케이블 연결 상태를 확인하세요.\n\
            4. TV가 채널 검색 중 또는 초기화 작동 중일 때 Anynet+(HDMI-CEC)가 작동하지 않습니다.\n\
            5. HDMI 케이블을 연결하거나 제거할 때에는 TV를 껐다가 다시 켜세요.\n"
    },
    {
        "prompt":"Anynet+를 종료하고 싶으면 어떻게 해?",
        "completion":"TV에 2개 이상의 HDMI 기기가 연결되었을 경우, TV와 연결된 특정 기기 1대의 Anynet+ 기능을 종료하려면 해당 기기의 설정에서 HDMI-CEC 기능을 끄세요.\n\
            TV의 Anynet+(HDMI-CEC) 기능을 끄면, 연결된 사운드바의 소리가 나지 않습니다.\n"
    },
    {
        "prompt":"'Anynet+ 연결 설정 중'이라고 나오면 어떻게 해?",
        "completion":"Anynet+를 구성 중이거나 시청 모드로 전환 중일 때에는 리모컨을 사용할 수 없습니다.\
            Anynet+ 설정 또는 시청 모드로 전환이 완료되면 리모컨을 사용하세요.\n"
    },
    {
        "prompt":"'Anynet+ 기기 연결을 해제합니다.'라고 나오면 어떻게 해?",
        "completion":"Anynet+를 구성 중이거나 시청 모드로 전환 중일 때에는 리모컨을 사용할 수 없습니다.\
            Anynet+ 설정 또는 시청 모드로 전환이 완료되면 리모컨을 사용하세요.\n"
    },
    {
        "prompt":"Anynet+ 기기가 재생되지 않는데 어떻게 해?",
        "completion": "초기화가 진행 중이면 재생 기능을 사용할 수 없습니다.\n"
    }
]

problem_remote_control = [
    {
        "prompt": "리모컨으로 TV를 조작할 수 없는데 어떻게 해?",
        "completion": "1. 삼성 스마트 리모컨과 TV의 연결이 끊어질 수 있습니다. 삼성 스마트 리모컨을 TV의 정면으로 향한 뒤 '이전'버튼과 '재생/일시정지'버튼을 동시에 3초 이상 누르세요.\n\
            2. 배터리 수명이 얼마 남지 않은 경우 리모컨이 동작하지 않거나 느려지는 증상이 발생할 수 있습니다.\n\
            1) 태양광 셀이나 리모컨 하단의 USB 포트(C-Type)를 통해 리모컨을 충전하세요. \
            리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'전원 및 절전'>'리모컨 배터리 잔량'을 선택하면 태양광 셀이 있는 삼성 스마트 리모컨의 배터리 잔량을 확인할 수 있습니다.\n\
            이 기능은 모델에 따라 지원되지 않을 수 있습니다.\n\
            2) 건전지를 사용하는 리모컨의 경우 건전지를 교체하세요.\n" 
    },
    {
        "prompt": "리모컨으로 외부기기를 조작할 수 없는데 어떻게 해?",
        "completion": "1. TV와 외부기기를 연결한 케이블의 연결 상태를 확인하세요.\n\
            2. 여전히 동작하지 않으면 리모컨의 '홈'버튼을 누른 후 '메뉴'>'연결된 기기'>'통합 리모컨 설정'을 선택하여 수동으로 설정할 수 있습니다.\n"
    }
]

problem_recording = [
    {
        "prompt" : "타임시프트 기능 또는 녹화 기능을 사용할 수 없는데 어떻게 해?",
        "completion" : "1. 저장 장치가 연결돼 있는지 확인하세요.\n\
            2. 방송 채널이 녹화 가능한 디지털 방송인지 확인하세요. 만약 방송 신호가 약하거나 잡히지 않으면 녹화가 자동으로 멈춥니다.\n\
            3. 저장 장치의 남은 공간을 확인하세요. 공간이 적으면 기능이 동작하지 않을 수 있습니다.\n\
            4. 외부 기기와 삼성 TV Plus 채널에서는 녹화 기능을 지원하지 않습니다.\n"
    },
    {
        "prompt" : "타임시프트 기능을 사용할 때 '포맷하세요'라는 메시지가 나타나면 어떻게 해?",
        "completion" : "녹화 기능을 사용하려면 TV와 연결된 저장 장치를 포맷해야 합니다. 저장 장치를 포맷할 경우 메모리에 저장된 모든 데이터가 삭제되며 NFTS 형식으로 포맷됩니다.\n"
    },
    {
        "prompt" : "녹화 기능 사용 시 '포맷하세요'라는 메시지가 나타나면 어떻게 해?",
        "completion": "녹화 기능을 사용하려면 TV와 연결된 저장 장치를 포맷해야 합니다. 저장 장치를 포맷할 경우 메모리에 저장된 모든 데이터가 삭제되며 NFTS 형식으로 포맷됩니다.\n"
    },
    {
        "prompt" : "TV에서 녹화된 파일이 PC에서 재생되지 않으면 어떻게 해?",
        "completion" : "TV에서 녹화된 파일은 해당 TV에서만 재생 가능합니다. PC나 다른 TV에서는 재생되지 않습니다.\n"
    }
]
problem_application = [
    {
        "prompt" : "앱의 언어를 바꾸려면 어떻게 해?",
        "completion" : "앱에서 지원하는 언어는 TV에서 설정한 언어와 다를 수 있습니다.\n\
            서비스 제공자에 따라 언어를 바꿀 수 있습니다. 해당 앱의 설정 메뉴에서 언어를 변경해 보세요.\n"
    },
    {
        "prompt" : "앱이 작동하지 않으면 어떻게 해?",
        "completion" : "1. 네트워크 연결 상태를 확인하세요. 네트워크 속도가 느리면 앱이 동작하지 않거나 저화질로 나올 수 있습니다.\n\
            2. 앱을 삭제한 후 재설치 해보세요.\n\
            3. 앱의 경우 TV에서 서비스를 제공하지 않고 앱 업체에서 서비스를 제공합니다. 문제가 해결되지 않을 경우 해당 앱의 서비스 제공 업체에 문의하세요.\n"
    },
    {
        "prompt" : "앱의 화질이 안좋으면 어떻게 해?",
        "completion" : "1. 네트워크 연결 상태를 확인하세요. 네트워크 속도가 느리면 앱이 동작하지 않거나 저화질로 나올 수 있습니다.\n\
            2. 앱을 삭제한 후 재설치 해보세요.\n\
            3. 앱의 경우 TV에서 서비스를 제공하지 않고 앱 업체에서 서비스를 제공합니다. 문제가 해결되지 않을 경우 해당 앱의 서비스 제공 업체에 문의하세요.\n"
    },
    {
        "prompt" : "스마트 허브 홈 화면이 TV를 켤때마다 계속 나오면 어떻게 해?",
        "completion" : "리모컨의 '홈'버튼을 누른 후 '메뉴'>'설정'>'전체 설정'>'일반 및 개인정보'>'시작 화면 설정'을 선택하여 스마트 허브 홈으로 시작 기능을 끄세요.\n"
    }
]

problem_media = [
    {
        "prompt": "파일이 재생 중에 끊기면 어떻게 해?",
        "completion":"이러한 현상은 지원하지 않는 파일이거나 콘텐츠의 비트레이트(초당 전송 단위)가 높아서 생기는 현상입니다. 일반적인 콘텐츠는 재생되지만, 일부는 재생이 원활하지 않을 수 있습니다.\n"
    },
    {
        "prompt" : "파일이 재생되지 않으면 어떻게 해?",
        "completion": "지원되지 않는 코덱을 사용하는 파일은 재생되지 않을 수 있습니다.\n"
    }

]